ability
able
about
above
absolutely
abuse
academic
accept
accepted
accepting
access
according
account
accurate
across
act
action
actions
active
actively
activities
activity
actual
actually
adam
adams
add
added
adding
addition
additional
address
administration
admit
admitted
adobe
advance
advanced
advantage
advice
affairs
afford
afraid
after
again
against
age
agencies
agency
agents
ago
agree
agreed
aid
air
aka
alan
algorithm
alive
all
allen
allow
allowed
allows
almost
alone
along
already
also
alternative
although
always
amazing
amendment
america
american
americans
amiga
among
amount
analysis
and
anderson
andrew
andy
angeles
announcement
anonymous
another
answer
answered
answers
anti
any
anybody
anymore
anyone
anything
anyway
anywhere
apart
apparently
appear
appears
apple
application
applications
applied
apply
applying
appreciate
appreciated
approach
appropriate
apr
april
arabs
archive
archives
are
area
areas
arent
argue
arguing
argument
arguments
armed
arms
army
around
art
article
artificial
ask
asked
asking
ass
assistance
assume
assuming
atf
atheism
atheist
attacks
attempt
attitude
august
austin
australia
authorities
authority
automatically
available
avenue
average
avoid
aware
away
back
bad
ball
bank
barely
barry
base
baseball
based
bases
basic
basically
basis
batch
batf
battle
bay
bbs
bear
beat
because
become
becomes
becoming
been
before
began
beginning
behind
being
belief
believe
bell
below
berkeley
besides
best
bet
better
between
beyond
biased
bible
big
bigger
bike
bill
billion
bit
bitnet
bits
black
blame
blind
block
blue
bmw
board
boards
bob
body
book
books
border
born
bosnia
boston
both
bought
box
brad
brain
branch
break
brian
bring
british
brother
brothers
brought
bruce
btw
build
building
built
bunch
bureau
burned
burns
bus
business
busy
but
buy
buying
calgary
california
call
called
calling
calls
calm
cambridge
came
campus
can
canada
cannot
cant
car
card
cards
care
career
carried
carry
cars
case
cases
cat
catch
catholic
caught
cause
caused
causes
center
central
centre
centuries
century
certain
certainly
champaign
chance
change
changed
changes
changing
chapter
character
charge
charles
cheap
cheaper
check
checked
cheers
chicago
child
children
chip
choice
chooses
chris
christ
christian
christianity
christians
christopher
church
circuit
cite
cities
citizens
city
civil
civilians
claim
claimed
claiming
claims
class
clayton
cleaning
clear
clearly
clh
client
clinton
clipper
clock
close
closed
closer
code
cold
college
color
colorado
colors
colour
combined
come
comes
coming
command
commands
comment
comments
commercial
committed
common
communication
communications
community
comp
companies
company
comparable
compare
compared
compgraphics
complete
completed
completely
complex
complicated
compound
compression
computer
computers
computing
concentrate
concept
concern
concerned
concerning
conclude
conclusion
conclusions
concrete
condition
conditions
conference
conflict
confused
congress
connection
consent
consider
consideration
considered
considering
constitution
contact
contain
contained
contains
context
continue
contract
control
controller
convert
cool
cooperation
copy
corp
corporation
correct
cost
costs
could
couldnt
count
counter
countries
country
couple
course
court
cover
coverage
covers
cpu
craig
cramer
create
creation
credit
crime
crimes
criminal
criminals
criticism
crowd
crypto
cult
culture
cup
curious
current
currently
cut
cyberspace
cycle
daily
dale
dan
danger
dangerous
daniel
dark
data
database
date
dave
david
davidians
day
days
dead
deal
dealer
dealers
dean
dear
death
debate
decide
decided
decision
deep
defend
defense
define
defined
definitely
degree
deleted
denver
department
depends
dept
des
describe
description
deserve
design
designed
desire
detailed
details
determine
develop
developing
development
device
dictionary
did
didnt
die
died
difference
different
difficult
digest
digital
direct
direction
directly
directory
disagree
disclaimer
discovered
discuss
discussed
discussion
disease
display
dispute
distribution
dividian
division
doctor
doctrine
document
documents
dod
does
doesnt
dogs
doing
dollars
don
done
dont
dos
double
doubt
doug
douglas
down
draft
draw
drawing
dream
drink
drinking
drive
driven
driver
drivers
drives
driving
dropped
drug
due
during
dust
duty
each
earlier
early
earth
easier
easily
east
eastern
easy
economic
economy
education
edward
effect
effective
effects
effort
efforts
eight
either
electrical
electronic
electronics
else
email
employer
encryption
end
ended
energy
enforcement
engineer
engineering
england
english
enjoy
enough
enter
entire
entirely
environment
equal
equipment
eric
error
errors
escape
escrow
especially
essentially
establish
etc
ethnic
europe
european
even
event
events
eventually
ever
every
everybody
everyone
everything
evidence
evil
exact
exactly
example
excellent
except
exception
excuse
exist
existence
existing
exists
expansion
expect
expected
expensive
experience
expert
explain
explaining
express
expressed
extended
extermination
external
extra
extremely
face
fact
facts
fail
failed
fair
fairly
faith
fall
fallen
falls
false
familiar
family
fan
fans
faq
far
fast
faster
favor
fax
fbi
fear
features
federal
fee
feel
feeling
fell
fellow
felt
few
field
fight
fighting
figure
figured
file
files
fill
final
finally
find
finding
fine
fire
firearms
firm
first
fit
five
fixed
flame
flames
flight
folks
follow
followed
following
follows
food
foot
football
for
force
forced
ford
foreign
forget
form
format
formed
former
forward
found
four
fourth
frame
france
frank
free
freedom
french
friend
friends
from
front
ftp
full
fully
fun
function
funding
funny
further
future
game
games
gary
gas
gateway
gave
general
generally
generate
generated
genocide
george
gerald
german
germans
germany
get
gets
getting
give
given
gives
giving
glad
gmt
goal
goals
god
gods
goes
going
gone
gonna
good
gordon
gospel
got
gotten
government
governments
govt
graduate
grand
graphics
gravity
great
greater
greatest
greatly
green
greg
ground
group
groups
guess
guest
gun
guns
guy
guys
had
half
hand
handle
hands
happen
happened
happening
happens
happy
hard
hardware
has
hasnt
hate
have
havent
having
head
health
hear
heard
heart
heat
heaven
heavy
heck
held
hell
hello
help
helps
henry
her
here
heres
hes
hey
high
higher
highly
hill
him
himself
his
historical
history
hit
hockey
hold
holocaust
home
homes
honestly
hope
hospital
host
hot
hour
hours
house
how
however
huge
hughes
huh
human
hundred
hurt
ibm
idea
ideas
ignore
ignored
ill
illegal
illinois
image
images
imagine
immediately
implied
important
inc
include
included
includes
including
income
incorporated
increase
increased
indeed
individual
individuals
industry
info
information
injury
innings
innocent
input
inside
install
installed
instance
instead
institute
instruments
insurance
intelligence
intended
interest
interested
interesting
interface
internal
international
internet
into
introduced
investigation
investors
involved
irrelevant
irvine
isnt
israel
israeli
issue
issues
its
itself
ive
jack
james
japan
jeff
jerry
jersey
jerusalem
jesus
jewish
jews
jim
job
joe
john
johnson
jon
jonathan
jose
joseph
judge
just
justice
keep
keeping
keeps
keith
ken
kept
kevin
key
keys
keywords
kill
killed
killing
kind
knew
know
knowing
knowledge
known
knows
koresh
lab
laboratory
labs
lack
land
language
languages
large
larger
last
late
later
laugh
launch
law
lawrence
laws
lead
leader
leaders
leading
leads
league
learn
learned
least
leave
leaving
led
lee
left
legal
legally
legitimate
length
less
let
lets
letter
letters
level
levels
lewis
liberty
libraries
library
license
life
light
like
likely
limit
limited
limits
line
lines
lineup
list
listen
little
live
lived
lives
living
local
log
logic
london
long
longer
look
looked
looking
looks
lord
los
lose
losing
loss
lost
lot
lots
louis
love
loved
low
lower
ltd
luck
lucky
lunar
lying
mac
machine
machines
made
mail
mailing
main
maintain
major
majority
make
makes
making
man
managed
management
manager
manual
many
mark
market
martin
mary
mask
mass
massacre
massive
match
material
math
mathematics
matter
matthew
maximum
may
maybe
mean
meaning
means
meant
medical
medicine
member
members
memory
men
mention
mentioned
merely
message
messages
met
method
michael
michigan
microsoft
mid
middle
might
mike
miles
military
miller
million
millions
mind
mine
minimum
minor
minority
minute
minutes
miss
missed
mission
mistake
mit
mode
model
models
modern
moment
mon
monday
money
monitor
month
months
moon
moral
morality
more
morning
most
mostly
motif
motor
motorola
mountain
mouse
move
moved
moving
much
multi
multiple
murder
murdered
museum
must
myself
name
names
nasa
nation
national
nations
native
nature
nazi
nazis
near
nearly
neat
necessarily
necessary
need
needed
needs
negative
neither
net
netcom
network
never
new
news
newsgroup
newsreader
next
nhl
nice
nichols
night
nine
nntp
nobody
non
none
nor
normal
north
not
note
nothing
now
nra
null
number
numbers
nyc
object
obtain
obvious
obviously
occupied
occur
off
offer
office
officers
often
oil
okay
old
once
one
ones
online
only
ontario
onto
open
operate
operation
operations
opinion
opinions
opportunity
opposed
optilink
option
options
orbit
order
ordered
organization
organizations
organized
original
originator
other
others
otherwise
ottawa
our
ourselves
out
output
outside
over
own
owner
owners
package
packet
page
pages
paid
paper
paragraph
parallel
parking
part
particular
particularly
parts
party
pasadena
pass
passed
passes
passing
past
pat
paul
pay
paying
pcs
peace
people
peoples
per
percent
percentage
perfect
perfectly
performance
perhaps
period
person
personal
personally
peter
pgp
phd
philadelphia
phone
photo
physical
picture
pictures
pitching
pittsburgh
place
places
plain
plan
planning
plans
plastic
play
played
player
players
playing
plays
please
plus
point
pointed
points
police
policy
political
politics
poor
pope
popular
population
position
positive
possibility
possible
possibly
post
posted
posters
posting
power
practical
practice
pray
prayer
prayers
pre
predictions
prefer
present
presented
president
press
pressure
presumably
pretty
prevent
previous
previously
price
prices
primarily
primary
prince
print
printed
printer
private
pro
probably
problem
problems
process
produce
produced
product
production
products
program
programming
programs
project
proof
propaganda
proper
property
proposed
protect
prove
proven
provide
provided
provides
providing
public
published
pull
pulling
purchase
purdue
pure
purpose
purposes
put
putting
pyramid
quality
question
questions
quick
quiet
quite
quote
quoted
race
radio
raised
ran
ranch
random
randy
range
rangers
rare
rate
rates
rather
ray
reach
reached
reaction
read
readers
reading
reads
real
reality
realize
really
rear
reason
reasonable
reasoning
reasons
recall
receive
received
recent
recently
record
records
red
redesign
reduce
reduced
refer
reference
references
referring
regard
regarding
regardless
regards
region
regular
related
relations
relatively
release
released
reliable
religion
religions
religious
remain
remaining
remember
remote
remove
removed
rent
repeat
replaced
reply
report
reported
reports
represent
representatives
represents
request
require
required
requires
requiring
research
reserve
resolution
resource
resources
respect
respond
response
responses
responsible
rest
restrictions
result
results
return
returned
review
rich
richard
ride
right
rights
risk
river
road
roads
rob
robert
rochester
rocketswstratuscom
roger
role
ron
room
round
rule
run
running
runs
russia
russian
ryan
safe
safety
said
sale
sam
same
san
save
saw
say
saying
says
scale
school
sci
science
sciences
scientific
scoring
scott
screen
screwed
search
season
sec
second
seconds
secret
section
secure
security
see
seeing
seem
seemed
seems
seen
select
self
sell
selling
send
sense
sent
separate
serdar
serial
series
serious
seriously
serve
served
server
service
services
session
set
setting
seven
several
sex
shall
shared
she
sherri
shipping
shit
short
shot
should
shouldnt
show
showed
showing
shown
shows
shut
shuttle
side
sig
sigh
signal
significance
significant
similar
simon
simple
simply
sin
since
single
sit
site
sites
situation
six
size
sky
sleep
small
smith
social
society
software
sold
solid
solution
solve
some
somebody
somehow
someone
something
sometimes
somewhat
somewhere
soon
sorry
sort
soul
sound
sounds
source
sources
south
southern
soviet
space
spacecraft
speak
speaking
special
specific
specifically
speculation
speed
spend
spent
spoke
spot
spring
stand
standard
standards
stanford
start
started
starting
starts
state
stated
statement
statements
states
station
statistics
stats
stay
stayed
step
stephen
steve
sticker
still
stolen
stone
stop
stopped
store
stores
story
stove
straight
strange
stratus
street
strictly
strong
strongly
stuck
student
studies
study
stuff
stupid
subject
subjects
submit
success
successful
such
suggest
suggested
suggestion
suggestions
suite
summary
summer
sun
sunday
supply
support
supported
supports
suppose
supposed
sure
surely
surface
surprise
surprised
survey
survivors
suspect
switch
syndrome
system
systems
table
tactics
take
taken
takes
taking
talk
talked
talking
tank
tape
target
task
taught
tavares
tax
taxes
team
technical
technologies
technology
tel
tell
telling
ten
terminal
terms
terrible
territory
terrorism
test
texas
text
than
thank
thanks
that
thats
the
their
them
themselves
then
theory
there
therefore
theres
these
they
theyd
theyre
thing
things
think
thinking
third
this
thomas
those
though
thought
thoughts
thousand
thousands
thread
threat
three
through
throughout
thus
tiff
tim
time
times
timothy
tin
tires
title
today
todays
together
told
tom
tomorrow
too
took
tools
top
toronto
total
totally
toward
towards
town
trade
tradition
traffic
translation
treat
treatment
tried
troops
trouble
truck
true
truly
trust
truth
try
trying
tuesday
turkey
turkish
turks
turn
turned
turns
two
type
types
under
underlying
understand
understanding
understood
unfortunately
unit
united
univ
universe
university
unix
unknown
unless
until
update
upon
urbana
usa
use
used
useful
useless
user
users
uses
using
ussr
usual
usually
uunet
valid
value
van
vancouver
various
vax
vehicle
version
versions
very
via
victims
video
view
viewer
views
violence
violent
virginia
virtual
virtually
visible
vision
visit
vms
vnews
voice
vote
waco
wait
waiting
walls
want
wanted
wants
war
warm
warning
warrant
was
washington
wasnt
waste
watch
watching
water
wave
way
ways
weapon
weapons
weather
wed
wednesday
week
weeks
weight
welcome
well
went
were
werent
west
western
what
whatever
whats
when
where
whether
which
while
white
who
whole
whom
whos
whose
why
wide
wife
wild
will
william
willing
win
window
windows
winner
winning
wins
wiretap
wish
with
within
without
women
won
wonder
wonderful
wondering
wont
wood
word
words
work
worked
working
works
world
worlds
worried
worse
worst
worth
would
wouldnt
write
writes
writing
written
wrong
wrote
yeah
year
years
yes
yesterday
yet
york
you
youd
youll
young
your
youre
yours
yourself
youve
zealand
zero
